Repository: barisgrbz/scanxcel
Catalog: lib/l10n/app_*.arb
Languages: tr

# saveButton
source: Save
tr: Kaydet

# viewRecordsButton
source: View Records
tr: Kayıtları Görüntüle

# clearDatabaseButton
source: Clear Data
tr: Barkodları Temizle

# exportToExcelButton
source: Export to Excel
tr: Excel'e Aktar

# showExcelButton
source: Show Excel
tr: Excel'i Göster

# settingsButton
source: Settings
tr: Ayarlar

# aboutButton
source: About
tr: Hakkında

# notificationsButton
source: Notifications
tr: Bildirimler

# barcodeFieldLabel
source: Barcode/QR Code {index}
tr: Barkod/QR Kod {index}

# barcodeFieldHint
source: Enter barcode or QR code value
tr: Barkod veya QR kod değerini girin

# defaultBarcodeLabel
source: Barcode/QR Code {index}
tr: Barkod/QR Kod {index}

# defaultDescriptionLabel
source: Description {index}
tr: Açıklama {index}

# descriptionFieldLabel
source: Description {index}
tr: Açıklama {index}

# descriptionFieldHint
source: Enter information
tr: Bilgi girin

# timestampFieldLabel
source: Timestamp
tr: Zaman Damgası

# saveSuccessMessage
source: Data saved successfully.
tr: Veriler kaydedildi.

# saveErrorMessage
source: Save error:
tr: Kaydetme hatası:

# exportSuccessMessage
source: Excel file downloaded.
tr: Excel dosyası indirildi.

# exportErrorMessage
source: Excel export error:
tr: Excel export hatası:

# clearSuccessMessage
source: Database cleared.
tr: Veri tabanı temizlendi.

# clearErrorMessage
source: Error:
tr: Hata:

# noDataMessage
source: No saved data in database.
tr: Veri tabanında kaydedilmiş veri bulunmuyor.

# emptyFieldsMessage
source: Please scan a barcode or enter a value manually.
tr: Lütfen barkod tarayın veya manuel olarak bir değer girin.

# settingsTitle
source: Settings
tr: Ayarlar

# barcodeFieldCountLabel
source: Number of barcode fields
tr: Barkod alanı adedi

# descriptionFieldCountLabel
source: Number of description fields
tr: Açıklama alanı adedi

# barcodeTitlesLabel
source: Barcode titles
tr: Barkod başlıkları

# descriptionTitlesLabel
source: Description titles
tr: Açıklama başlıkları

# titleLabel
source: Title {index}
tr: Başlık {index}

# saveSettingsButton
source: Save
tr: Kaydet

# loadingMessage
source: Loading...
tr: Yükleniyor...

# errorMessage
source: An error occurred
tr: Bir hata oluştu

# successMessage
source: Success
tr: Başarılı

# warningMessage
source: Warning
tr: Uyarı

# infoMessage
source: Information
tr: Bilgi

source: Language Selection
tr: Dil Seçimi

source: Turkish
tr: Türkçe

source: English
tr: İngilizce

source: version
tr: versiyon

# aboutAppTitle
source: About Application
tr: Uygulama Hakkında

# aboutDescription
source: ScanXcel is a practical application that makes your barcode and QR code scanning operations easier and allows you to export your data in Excel format.
tr: ScanXcel, barkod ve QR kod tarama işlemlerinizi kolaylaştıran, verilerinizi Excel formatında dışa aktarmanızı sağlayan pratik bir uygulamadır.

source: Barcode Scanning
tr: Barkod Tarama

source: Quick camera scanning
tr: Kamera ile hızlı tarama

source: Export data to Excel
tr: Verileri Excel'e aktarma

source: Dynamic Settings
tr: Dinamik Ayarlar

source: Customizable fields
tr: Özelleştirilebilir alanlar

source: Features
tr: Özellikler

# mobileWebSupport
source: 📱 Mobile and Web support
tr: 📱 Mobil ve Web desteği

source: 📷 Camera barcode scanning
tr: 📷 Kamera ile barkod tarama

# excelDataExport
source: 📊 Excel format data export
tr: 📊 Excel formatında veri export

source: ⚙️ Dynamic field configuration
tr: ⚙️ Dinamik alan yapılandırması

source: 💾 Local data storage
tr: 💾 Yerel veri saklama

source: 🔍 Advanced search features
tr: 🔍 Gelişmiş arama özellikleri

# copyright
source: © 2024 ScanXcel. All rights reserved.
tr: © 2024 ScanXcel. Tüm hakları saklıdır.
